<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"55c448020b7d29cf2000f4363ac6735fd15978e030a9435527296f3ab20ec949","plan_job_ref":"Job Plan Airflow DAGs #384 at https://github.com/cal-itp/data-infra/actions/runs/16485466877","plan_out_hash":"94a75049acaca35146f8ab4dcbb7493e4e66f15c6d4e2bec95cd3715bec8f07d","plan_hash":"9df1d457b6e0f9e5d166196d292eaec8929fd40f4f4a3ed4471ac8e518a5512e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 16 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "JHRIBw==" -> (known after apply)
!~      detect_md5hash      = "c16s+J1xbgxyIE5SmJO0iw==" -> "different hash"
!~      generation          = 1753225940061790 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "c16s+J1xbgxyIE5SmJO0iw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/gtfs_rt_stg_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "ucEJig==" -> (known after apply)
!~      detect_md5hash      = "UVHoAIks+BxdFYSto/FwcA==" -> "different hash"
!~      generation          = 1749663121217025 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
!~      md5hash             = "UVHoAIks+BxdFYSto/FwcA==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/gtfs_rt_stg_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "YcSQxg==" -> (known after apply)
!~      detect_md5hash      = "MfhP0Ps39ladjbRP4Da82Q==" -> "different hash"
!~      generation          = 1749663117055530 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
!~      md5hash             = "MfhP0Ps39ladjbRP4Da82Q==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/six_months_ago.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/macros/six_months_ago.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/macros/six_months_ago.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "N+KDhQ==" -> (known after apply)
!~      detect_md5hash      = "5g3x/rVX9jB4AV5atY8bqQ==" -> "different hash"
!~      generation          = 1749663119289221 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
!~      md5hash             = "5g3x/rVX9jB4AV5atY8bqQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "cjYetA==" -> (known after apply)
!~      detect_md5hash      = "+MSeIsqcpm3gClnxF6WhAA==" -> "different hash"
!~      generation          = 1749663119277167 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"
!~      md5hash             = "+MSeIsqcpm3gClnxF6WhAA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "R2duMg==" -> (known after apply)
!~      detect_md5hash      = "xW6gK1D2r/3nCz9jdETVlQ==" -> "different hash"
!~      generation          = 1749663118226563 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
!~      md5hash             = "xW6gK1D2r/3nCz9jdETVlQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "A1NONQ==" -> (known after apply)
!~      detect_md5hash      = "AtA3rjXGbDHDxOwTORMSsg==" -> "different hash"
!~      generation          = 1749663118792170 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"
!~      md5hash             = "AtA3rjXGbDHDxOwTORMSsg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "gG86IQ==" -> (known after apply)
!~      detect_md5hash      = "7mHBj4lipZInGbDopLlWWQ==" -> "different hash"
!~      generation          = 1749663115494807 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
!~      md5hash             = "7mHBj4lipZInGbDopLlWWQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "EA+aMg==" -> (known after apply)
!~      detect_md5hash      = "hnnHaAKBKgHEnp34Cs4TNA==" -> "different hash"
!~      generation          = 1749663120986328 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"
!~      md5hash             = "hnnHaAKBKgHEnp34Cs4TNA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "khpgPQ==" -> (known after apply)
!~      detect_md5hash      = "sQuECccLx05UaMTrCvcJNA==" -> "different hash"
!~      generation          = 1749663116090748 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"
!~      md5hash             = "sQuECccLx05UaMTrCvcJNA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "RDHGcg==" -> (known after apply)
!~      detect_md5hash      = "XKd8mzFThfzScDZK3ppV4A==" -> "different hash"
!~      generation          = 1749663118908140 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"
!~      md5hash             = "XKd8mzFThfzScDZK3ppV4A==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "JQWaBg==" -> (known after apply)
!~      detect_md5hash      = "wiNDqLsGaGJMwG6sNM1W+g==" -> "different hash"
!~      generation          = 1749663112445674 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"
!~      md5hash             = "wiNDqLsGaGJMwG6sNM1W+g==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "zxRw5w==" -> (known after apply)
!~      detect_md5hash      = "9OgEuYWBZq9cBuGJkTSxlA==" -> "different hash"
!~      generation          = 1749663116913625 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"
!~      md5hash             = "9OgEuYWBZq9cBuGJkTSxlA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5zFjVg==" -> (known after apply)
!~      detect_md5hash      = "+CQnZBkQEnuwtqUN+lL8yQ==" -> "different hash"
!~      generation          = 1749663119266065 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"
!~      md5hash             = "+CQnZBkQEnuwtqUN+lL8yQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "DeG5uQ==" -> (known after apply)
!~      detect_md5hash      = "0lukFV/5uMTquB3OpFKpqA==" -> "different hash"
!~      generation          = 1749663111487571 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"
!~      md5hash             = "0lukFV/5uMTquB3OpFKpqA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "THaQgA==" -> (known after apply)
!~      detect_md5hash      = "zpPvh0XCMLxYOU97JaCtZg==" -> "different hash"
!~      generation          = 1753225942805281 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "zpPvh0XCMLxYOU97JaCtZg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #384](https://github.com/cal-itp/data-infra/actions/runs/16485466877)